Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: The lock protects your code while it tests the condition and performs the task triggered by the condition.
ja: ロックはあなたのコードをそれが条件をテストしている間保護します、そして条件によって誘発される作業を実行します。

source: The logical combination of one or more specifier tests.
ja: ひとつ以上の指定子テストの論理結合。

source: The logon name of the current user.
ja: 現在のユーザのログオン名。

source: The long era symbols for the receiver
ja: レシーバに対する長い紀元シンボル。

source: The lower bound for the range.
ja: 範囲の下側の境界。

source: The lowest index whose corresponding array value is equal to an Object.
ja: それの対応する配列値がan Objectと同等である、最も低いインデックス。

source: The lowest index whose corresponding array value is identical to an Object.
ja: それの対応する配列値がan Objectと同一である、最も低いインデックス。

source: The lowest index whose corresponding value in the array passes the test specified by predicate.
ja: 配列の中のそれの対応する値がpredicateによって指定されるテストを合格する最も低いインデックス。

source: The lowest index within range whose corresponding array value is equal to an Object.
ja: それの対応する配列値がan Objectと同等であるrange内の最も低いインデックス。

source: The lowest index within range whose corresponding array value is identical to an Object.
ja: それの対応する配列値がan Objectと同一であるrange内の最も低いインデックス。

source: The magnitude of this decimal.
ja: この10進数の規模。

source: The main bundle lets you access the resources in the same directory as the currently running executable.
ja: メインバンドルは、あなたに同じディレクトリの中のリソースへ現在動作中の実行可能ファイルとしてアクセスを許します。

source: The main bundle represents the bundle directory that contains the currently executing code.
ja: メインバンドルは、現在実行しているコードを含むバンドルディレクトリを表します。

source: The main thread encompasses the application’s main run loop, and is where the NSApplication object receives events.
ja: メインスレッドは、アプリケーションのメイン実行ループを包み込みます、そしてNSApplicationオブジェクトがイベントを受け取るところです。

source: The majority of cookies encountered are in this format.
ja: 遭遇するクッキーの大多数は、この形式になります。

source: The mapping table maps the hashes {25, 96, 78, 32, 17} to the indexes {#0, #1, #2, #3, #4}.
ja: マッピングテーブルは、ハッシュ {25, 96, 78, 32, 17} をインデックス {#0, #1, #2, #3, #4} にマップします。

source: The matching options constants specify the reporting, completion and matching rules to the expression matching methods.
ja: マッチング・オプション定数は、情報提供を、表現マッチングメソッドに完了とマッチング規則を、指定します。

source: The matching options to report.
ja: 伝えるマッチング・オプション。

source: The matching options to use.
ja: 使用するマッチング・オプション。

source: The matching options.
ja: マッチング・オプション。

source: The mathematical constant pi.
ja: 数学の定数pi。

source: The matrix takes the following form:
ja: マトリックスは以下の形式をとります：

source: The matrix to append to the receiver.
ja: レシーバに加えられる行列。

source: The matrix to prepend to the receiver.
ja: この行列をレシーバの先頭に加えます。

source: The maximum error code value that represents an iCloud error.
ja: iCloudエラーを表す最大限のエラーコード値。

source: The maximum number of bytes to read.
ja: 読み出す最大限のバイト数。

source: The maximum number of elements to return.
ja: 返される要素の最大限の数。

source: The maximum number of time units to include in the output string.
ja: 出力文字列に含める最大の時間単位数。

source: The maximum number of times to split the collection, or one less than the number of subsequences to return.
ja: コレクションを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum range limits of the values that a given component can take on.
ja: 与えられた構成要素が取ることが可能な値の最大限界範囲。

source: The maximum size of Decimal.
ja: Decimalの最大限のサイズ。

source: The meanings of “upper” and “lower” (and “left” and “right”) are relative to the current coordinate system and the location of the rectangle.
ja: 「上」と「下」（そして「左」と「右」）の意味することは、現在の座標システムおよび矩形の位置に相対的です。

source: The mechanism for accessing the integers stored in an IndexSet.
ja: IndexSetの中に格納される整数にアクセスするための仕組み。

source: The mechanism for forwarding messages uses information obtained from method Signature For Selector: to create the NSInvocation object to be forwarded.
ja: このメッセージ転送メカニズムは、転送されることになるNSInvocationオブジェクトを作成するために、method Signature For Selector:から入手される情報を使います。

source: The message consists of a timestamp and the process ID prefixed to the string you pass in.
ja: メッセージは、あなたが渡す文字列に接頭辞として付けられるタイムスタンプとプロセスIDから構成されます。

source: The message in this case is a method of the current object that you want to execute on the target thread.
ja: この場合におけるメッセージは、現在のオブジェクトのメソッドです、それはあなたが目標のスレッド上で実行するのを望むものです。

source: The message in this case is a method of the current object that you want to execute on the thread.
ja: この場合におけるメッセージは、現在のオブジェクトのメソッドです、それはあなたがこのスレッド上で実行するのを望むものです。

source: The message that’s forwarded must have a fixed number of arguments; variable numbers of arguments (in the style of printf()) are not supported.
ja: 転送されるメッセージは、決まった数の引数を持つ必要があります；変動する個数の引数（printf()の形式）はサポートされません。

source: The metadata associated with a file.
ja: あるファイルと結び付けられるメタデータ。

source: The metadata associated with the response to a URL load request, independent of protocol and URL scheme.
ja: あるURLロード要請への応答と結び付けられたメタデータ、それはプロトコルまたはURLスキームから独立しています。

source: The metadata associated with the response to an HTTP protocol URL load request.
ja: あるHTTPプロトコルURLのロード要請に対する応答と結び付けられるメタデータ。

source: The method attempts to make all changes specified in attributes and ignores any rejection of an attempted modification.
ja: メソッドは、attributesで指定されたすべての変更をしようと試みます、そして試みられた変更のどんな拒絶も無視します。

source: The method copies into a Buffer the objects in the array in the range specified by a Range; the size of the buffer must therefore be at least the length of the range multiplied by the size of an object reference, as shown in the following example (this is solely for illustration—you should typically not create a buffer simply to iterate over the contents of an array):
ja: このメソッドはa Bufferへこの配列の中のa Rangeによって指定された範囲のオブジェクトをコピーします；パッファのサイズは、したがって少なくともオブジェクト参照サイズ掛ける範囲長でなければなりません、以下の例で示されるように（これはもっぱら解説のためのものです、あなたは概して配列要素全体に繰り返し処理するためにパッファを簡単に作成すべきではありません）：

source: The method differs from read To End Of File In Background And Notify() in that modes specifies the run-loop mode (or modes) in which NSFile Handle Read To End Of File Completion can be posted.
ja: メソッドは、read To End Of File In Background And Notify()とは、modesがそこにおいてNSFile Handle Read To End Of File Completionが投函されることが可能な実行ループモード（または複数のモード）を指定することにおいて異なります。

source: The method fails if the file cannot be written in its entirety
ja: ファイルがそっくりそのまま書き出されることができないならば、メソッドは失敗します。

source: The method first looks for a matching resource file in the non-localized resource directory of the specified bundle.
ja: メソッドは、指定されたバンドルの非ローカライズリソースディレクトリの中の合致するリソースファイル

source: The method represented by a Selector must set up the thread environment just as you would for any other new thread in your program.
ja: a Selectorによって表されるメソッドは、ちょうどあなたがあなたのプログラムにおいて何らかの他の新しいスレッドに対してするように、スレッド環境を準備しなければなりません。

source: The method should return NSOrdered Ascending if the receiving array is smaller than the argument, NSOrdered Descending if the receiving array is larger than the argument, and NSOrdered Same if they are equal.
ja: 受け手側の配列が引数より小さいならばメソッドはNSOrdered Ascending、受け手側の配列が引数より大きいならばNSOrdered Descending、そしてそれらが等しいならばNSOrdered Sameを返すはずです。

source: The method skips the “.” and “..” directories at each level of the recursion.
ja: このメソッドは、“.” と “..” ディレクトリを再帰の各水準でスキップします。

source: The methods in this category provide additional capabilities for working with key-value coding, including getting and setting key values by index in multi-value keys and coercing (or converting) a key value.
ja: このカテゴリの中のメソッドは、追加の能力をキー値コーディングを扱うために提供していて、複数値キーでのインデックスによるキー値の取得と設定、およびあるキー値の強制（または変換）を含みます。

source: The methods of the shared File Manager object can be called from multiple threads safely.
ja: 共有File Managerオブジェクトのメソッドは、複数のスレッドから安全に呼び出されることができます。

source: The methods of this class may be called safely from any thread of your app.
ja: このクラスのメソッドは、あなたのアプリのあらゆるスレッドから安全に呼び出されるでしょう。

source: The methods of this protocol accept either NSURL or NSString objects.
ja: このプロトコルのメソッドは、NSURLまたはNSStringオブジェクトのどちらでも受け入れます。

source: The minimum error code value that represents an iCloud error.
ja: iCloudエラーを表す最小限のエラーコード値。

source: The minimum time before which the message is sent.
ja: メッセージが送られる前の最小限の時間。

source: The month symbols for the receiver.
ja: レシーバに対する月シンボル。

source: The most common reason to construct an Apple event with an instance of NSApple Event Descriptor is to supply information in a return Apple event.
ja: NSApple Event Descriptorのインスタンスを使ってアップルイベントを組み立てる最も普通の理由は、返されるアップルイベントにおいて情報を提供することです。

source: The most common situation where you might need to extract information from an Apple event (as an instance of NSApple Event Descriptor) is when an Apple event handler installed by your application is invoked, as described in “Installing an Apple Event Handler” in How Cocoa Applications Handle Apple Events.
ja: あなたがあるアップルイベント（NSApple Event Descriptorのインスタンス）から情報を引き出す必要があるところの最も普通の状況は、「どのようにCocoaアプリケーションはアップルイベントを取り扱うか」の「アップルイベント・ハンドラーをインストールする」で記述されように、あなたのアプリケーションによってインストールされるあるアップルイベントハンドラが発動される時です。

source: The mutable string to search and replace values within.
ja: 内部の値を検索置換する、可変の文字列。

source: The name of a class.
ja: クラスの名前。

source: The name of a protocol.
ja: プロトコルの名前

source: The name of a resource file contained in the directory specified by bundle Path.
ja: bundle Pathによって指定されるディレクトリの中に含まれるあるリソースファイルの名前。

source: The name of a selector to resolve.
ja: この名前のセレクタを解決します。

source: The name of a user.
ja: ユーザの名前。

source: The name of an executable file.
ja: 実行可能ファイルの名前。

source: The name of the bundle subdirectory to search.
ja: 調査することになるバンドル下位ディレクトリの名前。

source: The name of the bundle subdirectory.
ja: バンドル下位ディレクトリの名前。

source: The name of the file or directory at path in a localized form appropriate for presentation to the user.
ja: pathでのファイルまたはディレクトリの名前、ユーザに提示するのに適切なローカライズされた形式で。

source: The name of the image resource file, without any pathname information.
ja: 画像リソースファイルの名前、まったくパス名情報なしで。

source: The name of the image resource file.
ja: 画像リソースファイルの名前。

source: The name of the nib file, which need not include the .nib extension.
ja: nibファイルの名前、それは.nib拡張子を含む必要はありません。

source: The name of the nib.
ja: nibの名前。

source: The name of the notification for which to register the observer; that is, only notifications with this name are delivered to the observer.
ja: それに対してオブザーバを登録する通知の名前；すなわち、この名前を持つ通知だけがオブザーバに配達されます。

source: The name of the relationship from the receiver’s class to another class.
ja: レシーバのクラスから別のクラスへのリレーションシップ（関係）の名前。

source: The name of the resource file.
ja: リソースファイルの名前。

source: The name of the sound resource file, without any pathname information.
ja: サウンドリソースファイルの名前、まったくパス名情報なしで。

source: The name used to identify a File Provider service.
ja: ファイルプロバイダサービスを識別するために使われる名前。

source: The names of the enumeration cases should match the names you've given to the corresponding properties in your type.
ja: これら列挙ケース節の名前は、あなたの型の中の対応するプロパティにあなたが与えた名前と合致しなければなりません。

source: The navigation style to apply to the object and its elements.
ja: オブジェクトとそれの要素に適用するナビゲーションスタイル。

source: The new array contains references to the receiving array’s elements, not copies of them.
ja: それらのコピーではなく、受け手側の持つ要素に対する参照を含んでいる新しい配列。

source: The new element is inserted before the element currently at the specified index.
ja: 新しい要素は、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new element to insert into the collection.
ja: コレクションに挿入されることになる新しい要素。

source: The new elements are inserted before the element currently at the specified index.
ja: 新しいいくらかの要素が、指定されたインデックスでの現在の要素の前に挿入されます。

source: The new elements to add to the collection.
ja: コレクションに加える新しいいくらかの要素。

source: The new elements to insert into the collection.
ja: コレクションへ挿入される新しいいくらかの要素。

source: The new location for the item in src URL.
ja: src URLの中の項目に対する新しい位置。

source: The new object.
ja: 新しいオブジェクト。

source: The new path for the copied file or directory.
ja: コピーされるファイルまたはディレクトリに対する新しいパス。

source: The new path for the file or directory.
ja: ファイルまたはディレクトリに対する新しいパス。

source: The new path for the item in src Path.
ja: src Pathにおける項目に対する新しいパス。

source: The new string to validate.
ja: 検証されることになる新しい文字列。

source: The new table adopts the callback functions of table and calls the hash and retain callback functions as appropriate when inserting elements into the new table.
ja: 新しいテーブルは、tableのコールバック関数を採用し、要素を新しいテーブルに挿入する時に、hashとretainコールバック関数を適切に呼び出します。

source: The next element in the table that enumerator is associated with, or NULL if enumerator has already iterated over all the elements.
ja: テーブルの中の次の要素、それはenumeratorが結びつけられるものです、またはNULL、もしenumeratorが既に全ての要素にわたって反復してしまったならば。

source: The next example attempts to retrieve an index six positions from s .start Index but fails, because that distance is beyond the index passed as limit.
ja: 次の例はs .start Indexから６位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The next example attempts to retrieve an index ten positions from numbers .start Index, but fails, because that distance is beyond the index passed as limit.
ja: 次の例はnumbers .start Indexから10位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The nodes in the abstract, logical tree structure that represents an XML document.
ja: XML文書を表す、抽象的、論理ツリー構造の中のノード。

source: The notification gets sent to a system-wide server that distributes it to all the tasks that have objects registered for distributed notifications.
ja: 通知は、いろいろな分散通知に登録されるいろいろなオブジェクトを持つタスク全てにそれを分散する、あるシステムワイドサーバに送られます。

source: The notification includes a user Info dictionary that contains the data read; access this object using the NSFile Handle Notification Data Item key.
ja: 通知は、読み込まれたデータを収容するuser Info辞書を含んでいます；このオブジェクトにNSFile Handle Notification Data Itemキーを使ってアクセスしてください。

source: The notification includes a user Info dictionary with the created NSFile Handle object, which is accessible using the NSFile Handle Notification File Handle Item key.
ja: 通知は、作成されるNSFile Handleオブジェクトを持つuser Info辞書を含みます、それはNSFile Handle Notification File Handle Itemキーを使って入手できます。

source: The notification object is the NSFile Handle object that sent the notification.
ja: 通知オブジェクトは、通知を送ったNSFile Handleオブジェクトです。

source: The number formatter used to format the numbers in energy strings.
ja: エネルギー文字列の中の数値を書式設定するために使われる数値フォーマッタ。

source: The number of bytes available in RAM.
ja: RAMにおいて利用可能なバイト数。

source: The number of bytes in a page.
ja: あるページの中のバイト数。

source: The number of bytes of memory to allocate.
ja: アロケートすることになるメモリのバイト数。

source: The number of bytes the data initially contains.
ja: データが初めに含むバイト数。

source: The number of bytes to copy.
ja: コピーされることになるバイト数。

source: The number of bytes to read from the receiver.
ja: レシーバから読み込んだバイト数。

source: The number of bytes to strip from the input data buffer.
ja: 入力データバッファから剝ぎ取るバイト数。

source: The number of characters in string.
ja: stringにおける文字数。

source: The number of descriptors in the receiver’s descriptor list (possibly 0); returns 0 if an error occurs.
ja: レシーバの持つ記述子リストの中の記述子の数（ことによると０）；エラーが起こるならば０を返します。

source: The number of descriptors in the receiver’s descriptor list.
ja: レシーバの持つ記述子リストの中の記述子の数。

source: The number of elements currently in table.
ja: 現在のtableの中の要素数。

source: The number of elements in the collection.
ja: コレクションの要素の数を返します。

source: The number of elements to drop from the beginning of the collection.
ja: コレクションの始まりから省く要素の数。

source: The number of elements to drop off the end of the collection.
ja: コレクションの終わりで省く要素の数。

source: The number of elements to remove from the collection.
ja: コレクションから除去される要素の数。

source: The number of elements to remove.
ja: 除去する要素の数を返します。

source: The number of extra bytes required for indexed instance variables (this value is typically 0).
ja: インデックスをつけられたインスタンス変数に必要とされる余分なバイト数（この値は一般的に0です）。

source: The number of key-value pairs currently in table.
ja: 現在tableの中にあるキー値ペアの数。

source: The number of levels deep the current object is in the directory hierarchy being enumerated.
ja: 現在のオブジェクトが列挙されているディレクトリ階層の深さ水準数。

source: The number of levels, with the directory passed to enumerator(at: including Properties For Keys: options: error Handler:) (NSFile Manager) considered to be level 0.
ja: enumerator(at: including Properties For Keys: options: error Handler:) (NSFile Manager)に渡されるディレクトリは階層0と考えての、階層水準数。

source: The number of matches of the regular expression.
ja: 正規表現のマッチの数。

source: The number of matches.
ja: マッチの数。

source: The number of minimum days in the first week.
ja: 最初の週における最も小さい日にち。

source: The number of new elements need not match the number of elements being removed.
ja: 新しい要素の数は、除去される要素の数と一致する必要はありません。

source: The number of objects in the array.
ja: 配列の中のオブジェクトの数。

source: The number of seconds from 1 January 1970 to the reference date, 1 January 2001.
ja: 1 January 1970から基準日、1 January 2001までの秒数。

source: The number of seconds to add to date.
ja: dateに加える秒数。

source: The number of times to repeat the value passed in the repeating parameter.
ja: repeatingパラメータで渡された値を繰り返す回数。

source: The number of units to move along the x axis.
ja: x軸に沿って移動する単位数。

source: The number of units to move along the y axis.
ja: y軸に沿って移動する単位数。

source: The number of values from the objects C array to include in the new array.
ja: objects C配列から新しい配列の中に含めることになる値の数。

source: The number specifies the number of hard links to a file.
ja: この数は、あるファイルへのハードリンクの数を指定します。

source: The object copy is then added to the returned array.
ja: オブジェクトのコピーはそれから返される配列に加えられます。

source: The object encode instead of the receiver (if different).
ja: エンコードするオブジェクト、レシーバの代理（異なるならば）。

source: The object for which a textual representation is returned.
ja: このオブジェクトに対するテキスト表現が返されます。

source: The object for which to return an editing string.
ja: それに対して編集する文字列を返すことになるオブジェクト。

source: The object in this parameter must be a NSDate Components object; if it is not, the method raises an exception.
ja: このパラメータの中のオブジェクトは、NSDate Componentsオブジェクトでなければなりません；それがそうでないならば、メソッドは例外を引き起こします。

source: The object located at index.
ja: indexに位置するオブジェクト。

source: The object that performs the coercion.
ja: 強制を実行するオブジェクト。

source: The object that will be the nib’s owner.
ja: nibの所有者であるオブジェクト。

source: The object that will write data to the returned file handle must add itself as an observer of NSFile Handle Connection Accepted.
ja: 返されたファイルハンドルにデータを書き出すオブジェクトは、それ自身をNSFile Handle Connection Acceptedのオブザーバとして加えなければなりません。

source: The object to assign as the nib’s File's Owner object.
ja: nibのもつFile's Ownerオブジェクトとしてアサインすることになるオブジェクト。

source: The object to copy.
ja: コピーするオブジェクト。

source: The object to encode.
ja: エンコードするオブジェクト。

source: The object to register for KVO notifications.
ja: KVO通知に登録するオブジェクト。

source: The object to substitute for the receiver during archiving.
ja: アーカイブの間にレシーバの代わりをするオブジェクト。

source: The object to which unrecognized messages should first be directed.
ja: 有効でないメッセージが最初に向けられるべきオブジェクト。

source: The object whose notifications the observer wants to receive; that is, only notifications sent by this sender are delivered to the observer.
ja: オブザーバが受け取ることを望む通知を持つオブジェクト；すなわち、この送り手によって送られる通知のみがオブザーバに配達されます。

source: The object will be encoded as if it were a member of the class.
ja: オブジェクトは、それがこのクラスのメンバーであるかのようにエンコードされるでしょう。

source: The objects contained by this array are immutable, even if the array is mutable.
ja: この配列に含まれるオブジェクトは不変です、その配列が可変だとしてもです。

source: The observer must implement the key-value observing method observe Value(for Key Path: of: change: context:).
ja: オブザーバは、キー値監視メソッドobserve Value(for Key Path: of: change: context:)を実装しなければなりません。

source: The offset to be added to the location of the result in the string.
ja: 文字列において結果の場所に加えられるオフセット。

source: The offset to seek to.
ja: このオフセットへとシークすることになります。

source: The offset within the file that will mark the new end of the file.
ja: 新しいファイルの終端を印するファイル内部のオフセット。

source: The one-based descriptor list position at which to insert the descriptor.
ja: １起点の記述子リスト位置、そこで記述子が挿入されることになります。

source: The one-based descriptor list position of the descriptor to get the keyword for.
ja: それのキーワードを取得することになる記述子の、１起点の記述子リスト位置。

source: The one-based descriptor list position of the descriptor to return.
ja: 返される記述子の１起点記述子リスト位置

source: The one-based position of the descriptor to remove.
ja: 取り除かれることになる記述子の１起点の位置。

source: The operation doesn’t require going beyond the limiting numbers .end Index value, so it succeeds.
ja: この操作は、限度であるnumbers .end Index値を越えることを要求しません、それでそれは成功します。

source: The operation doesn’t require going beyond the limiting s .end Index value, so it succeeds.
ja: 演算は、限界であるs .end Index値を超えていく必要はありません、それでそれは成功します。

source: The optional methods implemented by the delegate of a keyed archiver.
ja: キー付きアーカイバの委任先によって実装されるオプショナルメソッド。

source: The optional methods implemented by the delegate of a keyed unarchiver.
ja: キー付きアンアーカイバの委任先によって実装されるオプショナルメソッド。

source: The optional methods implemented by the delegate of a spell server.
ja: スペルサーバーのデリゲートによって実装される任意のメソッド。

source: The options are defined in NSAlignment Options.
ja: オプションは、NSAlignment Optionsで定義されます。

source: The options property specifies aspects of the regular expression matching that are always used when matching the regular expression.
ja: optionsプロパティは、正規表現にマッチするとき常に使われる、正規表現マッチングの様相を示します。

source: The options to use during the replacement.
ja: 置換の間に使うためのオプション。

source: The options to use for the encoding.
ja: エンコードするのに使うオプション。

source: The order of classes in Xcode’s project browser is the order in which they will be linked.
ja: Xcodeのプロジェクトブラウザの中のクラスの順番は、それらがリンクされることになる順番です。

source: The order of initialization is as follows:
ja: 初期化の順番は以下になります：

source: The order of the files in the returned array is undefined.
ja: 返される配列の中のファイルの順番は、未定義です。

source: The ordinal number of smaller within larger at the time specified by date.
ja: 日付によって指定された時間でのより大きいものの内部のより小さいものの順序数。

source: The ordinality is in most cases not the same as the decomposed value of the component.
ja: 順序性は、たいていの場合はその構成要素の分解された値と同じではありません。

source: The original NSBezier Path object is not modified.
ja: オリジナルのNSBezier Pathオブジェクトは、修正されません。

source: The original string, before the proposed change.
ja: 提案される変更より前の、元の文字列。

source: The output formatting options that determine the readability, size, and element order of an encoded JSON object.
ja: エンコードされたJSONオブジェクトの読み出し可能性、サイズ、そして要素順序を決定する出力書式設定オプション。

source: The owner ID is set to the effective user ID of the process.
ja: 所有者IDは、現在のプロセスの実効ユーザIDに設定されます。

source: The parameter descriptor to add to the receiver.
ja: レシーバに加えられることになるバラメータ記述子。

source: The path at which to create the new directory.
ja: そこで新しいディレクトリを作成することになるパス。

source: The path at which to create the new symbolic link.
ja: このパスで新しいシンボリックリンクを作成することになります。

source: The path at which to place the copy of src Path.
ja: そこにsrc Pathのコピーを置くことになるパス。

source: The path for a symbolic link.
ja: シンボリックリンクに対するパス。

source: The path for the file or directory that the file manager tried to delete.
ja: ファイルマネージャが削除しようとしたファイルまたはディレクトリに対するパス。

source: The path for the new file.
ja: 新しいファイルに対するパス。

source: The path of a file or directory to compare with the contents of path1.
ja: path1の内容と比較するファイルまたはディレクトリのパス。

source: The path of a file or directory to compare with the contents of path2.
ja: path2の内容と比較するファイルまたはディレクトリのパス。

source: The path of a file or directory.
ja: ファイルまたはディレクトリのパス。

source: The path of a symbolic link.
ja: シンボリックリンクのパス。

source: The path of a top-level bundle directory.
ja: トップレベルバントルディレクトリのパス。

source: The path of the directory or file to which the symbolic link path refers, or nil upon failure.
ja: ディレクトリまたはファイルのパス、それに対してシンボリックリンクpathが言及します、または失敗ではnil。

source: The path of the directory to enumerate.
ja: 列挙するディレクトリのパス。

source: The path of the directory to list.
ja: 一覧にするディレクトリのパス。

source: The path of the directory to which to change.
ja: それに変更する、ディレクトリのパス。

source: The path of the element, in screen coordinates.
ja: 要素のバス、画面座標で。

source: The path of the file or directory that the file manager tried to move.
ja: ファイルマネージャが移動しようとしたファイルまたはディレクトリへのパス。
